Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ནི་སྤྲོར་མེད་པའོ།
en: The buddhafields to be refined and the beings that are to be brought to maturity are free from conceptual elaboration.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་སྤྲོར་མེད་པའོ།
en: The ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct attributes of the buddhas are free from conceptual elaboration.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་སྤྲོར་མེད་པའོ།
en: All-aspect omniscience is free from conceptual elaboration.

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བ་ནི་སྤྲོར་མེད་པའོ།
en: The abandonment of all afflicted mental states associated with reincarnation through the continuity of propensities is free from conceptual elaboration.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྤྲོར་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: It is in this way, Subhūti, that bodhisattva great beings should practice the perfection of wisdom that is without conceptual elaboration. “

source: །རབ་འབྱོར་འདི་ལྟར་ཡང་གཟུགས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: Subhūti, it is indeed the case that physical forms have no essential nature.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: Feelings, perceptions, formative predispositions, and consciousness have no essential nature.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The sense fields, the sensory elements, and the links of dependent origination have no essential nature.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ལ་ངོ་བོ་ཉིད་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment have no essential nature.

source: བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways have no essential nature.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The fruit of entering the stream to nirvāṇa has no essential nature.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship have no essential nature.

source: །རང་བྱང་ཆུབ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: Individual enlightenment has no essential nature.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The bodhisattva levels have no essential nature.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The maturity of the bodhisattvas has no essential nature.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The buddhafields to be refined and the beings that are to be brought to maturity have no essential nature.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas have no essential nature.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: All-aspect omniscience has no essential nature. “

source: །གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་སྤྲོར་མེད་པ་སྟེ།
en: That which has no essential nature is without conceptual elaboration.

source: རབ་འབྱོར་དེའི་ཕྱིར་ན། གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་སྤྲོར་མེད་པའོ།
en: Therefore, Subhūti, physical forms, feelings, perceptions, formative predispositions, and consciousness are without conceptual elaboration.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་སྤྲོར་མེད་པའོ།
en: The sense fields, the sensory elements, and the links of dependent origination are without conceptual elaboration. {

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Ki.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ནི་སྤྲོར་མེད་པའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: V: 153} All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are without conceptual elaboration.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ནི་སྤྲོར་མེད་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are without conceptual elaboration.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ནི་སྤྲོར་མེད་པའོ།
en: The buddhafields to be refined and the beings that are to be brought to maturity are without conceptual elaboration.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི་སྤྲོར་མེད་པའོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are without conceptual elaboration.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་གོ །གསོལ་པ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they enter a bodhisattva’s full maturity.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་གང་ལ་ཡང་ངོ་བོ་ཉིད་དམིགས་སུ་མ་མཆིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་ཀྱི་ཤུལ་ཏམ། སངས་རྒྱས་ཀྱི་ཤུལ་ཏམ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཤུལ་ཏམ། ཆོས་གང་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པར་འགྱུར།
en: Blessed Lord, if the essential nature is not apprehended with respect to anything at all, by what do bodhisattva great beings enter a bodhisattva’s full maturity—the pathway of the śrāvakas or the pathway of the pratyekabuddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་ཀྱི་ལམ་གྱིས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མི་འཇུག །
en: Subhūti,” replied the Blessed One, “bodhisattva great beings do not enter a bodhisattva’s full maturity through the path of the śrāvakas.

source: རང་སངས་རྒྱས་ཀྱི་ལམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མི་འཇུག །
en: They do not enter a bodhisattva’s full maturity through the path of the pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ལམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མི་འཇུག་གི །
en: Bodhisattva great beings do not enter a bodhisattva’s full maturity through the path of the completely awakened buddhas.

source: རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལམ་ཐམས་ཅད་ལ་བསླབས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: Rather, Subhūti, it is the case that bodhisattva great beings, having trained in all pathways, then enter a bodhisattva’s full maturity.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བརྒྱད་པ་ནི་ཆོས་ཐམས་ཅད་ལ་བསླབས་ཤིང་། ཡང་དག་པའི་སྐྱོན་མེད་པར་འཇུག་སྟེ་ནམ་འབྲས་བུའི་ལམ་མ་གྲུབ་ཀྱི་བར་དུ་འབྲས་བུ་ཐོབ་པར་མི་བྱེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ལམ་ཐམས་ཅད་ལ་བསྒྲུབས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་སྟེ།
en: Just as an arhat of the eighth level, having trained in all attributes, enters into the authentic maturity appropriate for an arhat, and never attains the fruit of arhatship until the fruitional path has been accomplished, in the same way, Subhūti, bodhisattva great beings also accomplish all paths and then enter a bodhisattva’s full maturity.

source: ནམ་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་མ་གྱུར་གྱི་བར་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་བྱེད་དོ།
en: They will never attain all-aspect omniscience until they have attained the vajra-like meditative stability.

source: །དེས་ཏིང་ངེ་འཛིན་དེ་ཐོབ་མ་ཐག་ཏུ་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ། །གསོལ་པ།
en: Immediately after attaining that meditative stability, they will attain all-aspect omniscience through the wisdom of a single instant.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤུལ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པར་བགྱི་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་བརྒྱད་པའི་ཤུལ་ཀྱང་གཞན། རྒྱུན་དུ་ཞུགས་པའི་ཤུལ་ཀྱང་གཞན། ལན་ཅིག་ཕྱིར་འོང་བར་ཞུགས་པའི་ཤུལ་ཀྱང་གཞན། ལན་ཅིག་ཕྱིར་འོང་བའི་ཤུལ་ཀྱང་གཞན། ཕྱིར་མི་འོང་བར་ཞུགས་པའི་ཤུལ་ཀྱང་གཞན། ཕྱིར་མི་འོང་བའི་ཤུལ་ཀྱང་གཞན། དགྲ་བཅོམ་པར་ཞུགས་པའི་ཤུལ་ཀྱང་གཞན། དགྲ་བཅོམ་པའི་ཤུལ་ཀྱང་གཞན།
en: Blessed Lord, if bodhisattva great beings enter a bodhisattva’s full maturity after perfecting all pathways, is it the case, Blessed Lord, that the pathway of arhats on the eighth level is indeed one distinct path, that the pathway of those destined for only one more rebirth is another, that the pathway of those no longer subject to rebirth is another, that the pathway of those entering arhatship is another, that the pathway of arhats is another, that the pathway of pratyekabuddhas is another, and that the pathway of the tathāgatas, arhats, completely awakened buddhas is another?

source: རང་སངས་རྒྱས་སུ་ཞུགས་པའི་ཤུལ་ཀྱང་གཞན། རང་སངས་རྒྱས་ཀྱི་ཤུལ་ཀྱང་གཞན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཤུལ་ཀྱང་གཞན་ཏེ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤུལ་དེ་དག་གཞན་དང་གཞན་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤུལ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཏེ།
en: Blessed Lord, if these pathways are distinct from one another, how do bodhisattva great beings perfect all pathways and enter a bodhisattva’s full maturity? {

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པར་བགྱི།
en: Ki.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤུལ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱི་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བརྒྱད་པའི་ཤུལ་བསྒྲུབས་ཤིང་། བརྒྱད་པར་མི་འགྱུར་ཏམ།
en: V: 154} Blessed Lord, if bodhisattva great beings perfect all pathways, do those bodhisattva great beings not become arhats of the eighth level after accomplishing the pathway of the eighth level?

source: མཐོང་བའི་ཤུལ་བསྒྲུབས་ཤིང་། རྒྱུན་དུ་ཞུགས་པར་མི་འགྱུར་ཏམ།
en: Do they not become one entering the stream to nirvāṇa after accomplishing the pathway of insight?

source: བསྒོམ་པའི་ཤུལ་བསྒྲུབས་ཤིང་། ལན་ཅིག་ཕྱིར་འོང་བར་ཞུགས་པ་འམ། ལན་ཅིག་ཕྱིར་འོང་བར་མི་འགྱུར་ཏམ།
en: Do they not become one entering into the fruit of being destined for only one more rebirth after accomplishing the pathway of cultivation?

source: ཕྱིར་མི་འོང་བར་ཞུགས་པ་འམ། ཕྱིར་མི་འོང་བར་མི་འགྱུར་ཏམ།
en: Do they not become one entering the fruit of no longer being subject to rebirth, or do they not become one established in the fruit of no longer being subject to rebirth?

source: དགྲ་བཅོམ་པར་ཞུགས་པ་འམ། དགྲ་བཅོམ་པར་མི་འགྱུར་ཏམ།
en: Do they not enter into arhatship, or do they not become arhats?

source: རང་སངས་རྒྱས་ཀྱི་ཤུལ་བསྒྲུབས་ཤིང་། རང་སངས་རྒྱས་སུ་མི་འགྱུར་ཏམ།
en: Having accomplished the pathway of the pratyekabuddhas, do they not become pratyekabuddhas?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བརྒྱད་པར་གྱུར་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པའི་གནས་དང་སྐབས་མ་མཆིས་ཏེ།
en: Blessed Lord, after becoming arhats of the eighth level, there would be no opportunity for bodhisattva great beings to enter a bodhisattva’s full maturity.

source: དེ་ནི་གནས་མ་ལགས་སོ།
en: That would be impossible!

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་མ་ཆུད་པར་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའི་གནས་མ་མཆིས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: It is also impossible that they could attain all-aspect omniscience without having entered into the maturity of the bodhisattvas.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པའི་གནས་མ་མཆིས།
en: And after attaining the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment, it is impossible that they could enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་མ་ཆུད་པར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའི་གནས་མ་མཆིས་ན། བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤུལ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཤིང་།
en: If it is not possible to attain all-aspect omniscience without having entered into the maturity of the bodhisattvas, in that case, Blessed Lord, how should one understand that bodhisattva great beings perfect all pathways and enter a bodhisattva’s full maturity?

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་འཇུག་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པར་ཆུད་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བར་འགྱུར་བ་ཇི་ལྟར་འཚལ་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How do they attain all-aspect omniscience, having entered into the maturity of the bodhisattvas, and how do they abandon all afflicted mental states associated with reincarnation through the continuity of propensities?” “

source: དེ་དེ་བཞིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་པར་འགྱུར་ཏེ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པ་འམ།
en: It is so,” replied the Blessed One. “

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་པ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པ་འམ། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པ་འམ། རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པའི་གནས་དང་སྐབས་མེད་དེ།
en: There is no opportunity for bodhisattva great beings, on becoming arhats of the eighth level, or after attaining the fruit of entering the stream to nirvāṇa, or attaining the fruit of being destined for only one more rebirth, or attaining the fruit of no longer being subject to rebirth, or attaining arhatship, or attaining individual enlightenment, to enter a bodhisattva’s full maturity.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མ་ཆུད་པར་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའི་གནས་མེད་དོ།
en: It is also impossible that bodhisattva great beings could attain all-aspect omniscience without having entered into the maturity of the bodhisattvas.

source: །རབ་འབྱོར་འོན་ཀྱང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། ཤེས་པ་དང་མཐོང་བས་ས་བརྒྱད་ལས་ཡོངས་སུ་འདའ་སྟེ། བརྒྱད་གང་ཞེ་ན། དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་དང་།
en: And yet, Subhūti, it is the case that when bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, practice the six perfections, they transcend eight levels through their cognition and insight.

source: རིགས་ཀྱི་ས་དང་། བརྒྱད་པའི་ས་དང་། མཐོང་བའི་ས་དང་། བསྲབས་པའི་ས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ས་དང་།
en: If you ask what are these eight, they comprise (1) the level of bright insight, (2) the level of the spiritual family, (3) the eighth-lowest level, (4) the level of insight, (5) the level of attenuated refinement, (6) the level of no attachment, (7) the level of an arhat’s spiritual achievement, and (8) the level of the pratyekabuddhas.

source: བྱས་པ་རྟོགས་པའི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་སྟེ། ས་བསྟན་པ་བརྒྱད་པ་འདི་དག་ལས་ཤེས་པ་དང་མཐོང་བ་ལས་འདས་ནས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: After transcending these eight levels that have been described through their cognition and insight, they then enter a bodhisattva’s full maturity by means of understanding the path.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས།
en: Having entered into the maturity of the bodhisattvas, {Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་ངོ་།
en: V: 155} they then abandon all afflicted mental states associated with reincarnation through the continuity of propensities by means of the wisdom of all-aspect omniscience. “

source: །རབ་འབྱོར་དེ་ལ་བརྒྱད་པའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ་རྒྱུན་དུ་ཞུགས་པའི་ཡེ་ཤེས་དང་།
en: In this regard, Subhūti, the wisdom [and renunciation] of an arhat of the eighth level are indeed within what bodhisattva great beings accept.

source: སྤོང་བའི་ཡེ་ཤེས་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ།
en: The wisdom and renunciation of one entering the stream to nirvāṇa are also within what bodhisattva great beings accept.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་ཡེ་ཤེས་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ།
en: The wisdom and renunciation of one destined for only one more rebirth are also within what bodhisattva great beings accept.

source: ཕྱིར་མི་འོང་བའི་ཡེ་ཤེས་དང་སྤོང་བ་གང་ཡིན་པ་དེ་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ།
en: The wisdom and renunciation of one no longer subject to rebirth are also within what bodhisattva great beings accept.

source: དགྲ་བཅོམ་པའི་ཡེ་ཤེས་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ།
en: The wisdom and renunciation of an arhat are also within what bodhisattva great beings accept.

source: རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་། སྤོང་བ་གང་ཡིན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ་ཆེན་པོ་སྟེ།
en: The wisdom and renunciation of a pratyekabuddha are also within what bodhisattva great beings accept.

source: དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཤིང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: In this way, having perfected the paths of the śrāvakas and the pratyekabuddhas, bodhisattva great beings enter a bodhisattva’s full maturity by means of the wisdom of knowledge of the path.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་ངོ་།
en: Having entered into the maturity of the bodhisattvas, by means of all-aspect omniscience they abandon all afflicted mental states associated with reincarnation through the continuity of propensities.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་འབྲས་བུ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་འགྱུར་རོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་བཅུ་གསུམ་པ།
en: So it is, Subhūti, that bodhisattva great beings, after perfecting all paths, then attain consummate buddhahood in unsurpassed, complete enlightenment, and fruitfully sustain all beings.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་གང་ཉན་ཐོས་ཀྱི་ཤུལ་དང་། རང་སངས་རྒྱས་ཀྱི་ཤུལ་དང་། སངས་རྒྱས་ཀྱི་ཤུལ་དེ་དག་ལས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཤུལ་གང་ལགས།
en: Blessed Lord, what is the pathway of knowledge of the path, distinct from the pathway of the śrāvakas, the pathway of the pratyekabuddhas, and the pathway of the buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་བསྒྲུབ་པར་བྱ་སྟེ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings should achieve the pure knowledge of the path.

source: དེ་ལ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་ནི་རྣམ་པ་གང་དང་གང་། ཚུལ་གང་དང་གང་། མཚན་མ་གང་དང་གང་གིས་ལམ་དུ་བརྗོད་པའི་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་དང་།
en: In this regard, the pure knowledge of the path is as follows: Bodhisattva great beings should attain consummate buddhahood with respect to those aspects, marks, and signs that express the path.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཅི་ནས་ཀྱང་གཞན་གྱིས་ཤེས་པར་འགྱུར་བ་དང་། གཞན་གདུལ་བའི་དོན་དུ་གཞན་ལ་བརྗོད་པ་དང་། བསྟན་པ་དང་། བཤད་པ་དང་།
en: Having attained consummate buddhahood, they should by all means proclaim, reveal, explain, make known, and establish them for the sake of others, so that others might understand them and be disciplined.

source: གདགས་པ་དང་། རྣམ་པར་དགོད་པ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྒྲ་བརྙན་ལྟ་བུར་ཤེས་པར་བྱ་བའི་དོན་དུ། སྒྲ་སྐད་དང་བརྡར་བྱ་བ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གོ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་སྒྲ་སྐད་དང་བརྡ་ཐམས་ཅད་བརྗོད་པར་བྱ། ཡོངས་སུ་གཟུང་བར་བྱ་སྟེ།
en: To that end, in order to make them become known, like an echo, bodhisattva great beings should communicate in and acquire all the languages and symbols that are understood in the world system of the great trichiliocosm. “

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: For this reason, Subhūti, bodhisattva great beings should perfect all paths.

source: །ལམ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་རིག་པར་བྱ་སྟེ།
en: Having perfected all paths, they should be aware of the mindsets of all beings.

source: སེམས་ཅན་དམྱལ་བ་བའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བ་བའི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ། །འབྲས་བུ་ཤེས་པར་བྱའོ། །དེས་ཀྱང་སེམས་ཅན་དམྱལ་བ་བའི་ལམ་བཟློག་པར་བྱ་སྟེ།
en: That is to say, they should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads the denizens of the hells to the hells, and thereby they should indeed avert beings from the path of the denizens of the hells.

source: རྒྱུ་ལས་ཀྱང་བཟློག་པར་བྱའོ། །འབྲས་བུ་ལས་ཀྱང་བཟློག་པར་བྱའོ།
en: They should also avert them from its causal basis, and they should also avert them from its result. {Ki.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་སེམས་ཅན་རྣམས་ཀྱི་བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ་འབྲས་བུ་ཤེས་པར་བྱའོ། །དེས་ཀྱང་བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་བཟློག་པར་བྱ་སྟེ།
en: V: 156} “They should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads the beings of the animal realm to be born in the animal realm, and thereby they should indeed avert beings from the path of the animal realm.

source: རྒྱུ་ལས་ཀྱང་བཟློག་པར་བྱའོ་འབྲས་བུ་ལས་ཀྱང་བཟློག་པར་བྱའོ།
en: They should also avert them from its causal basis, and they should also avert them from its result. “

source: །གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ། །འབྲས་བུ་ཤེས་པར་བྱའོ། །དེས་ཀྱང་གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་ལས་ཀྱང་བཟློག་པར་བྱའོ།
en: They should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads the beings of the world of Yama to the world of Yama, and thereby they should indeed avert beings from the path of the world of Yama.

source: །རྒྱུ་ལས་ཀྱང་བཟློག་པར་བྱའོ། །འབྲས་བུ་ལས་ཀྱང་བཟློག་པར་བྱའོ། །མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: They should also avert them from its causal basis, and they should also avert them from its result. “

source: མི་དང་། ལྷ་དང་། ཚངས་པ་རྣམས་ཀྱི་ལམ་ཤེས་པར་བྱའོ། །རྒྱུ་ཤེས་པར་བྱའོ། །འབྲས་བུ་ཤེས་པར་བྱའོ། །ཀུན་སྣང་དང་བའི་ལྷ་རྣམས་དང་། དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་དང་། འདུ་ཤེས་མེད་པའི་སེམས་ཅན་རྣམས་དང་། མི་ཆེ་བའི་ལྷ་རྣམས་དང་། མི་གདུང་བའི་ལྷ་རྣམས་དང་། ཤིན་དུ་མཐོང་བའི་ལྷ་རྣམས་དང་།
en: They should know the path, they should know the causal basis [of the path], and they should know the result [of the path] that leads to the domains of kinnaras, mahoragas, nāgas, yakṣas, humans, gods, and Brahma divinities.
